import { defineStore } from "pinia";
import { useCookie } from "@/composables.js";
import http from "@/libs/axios.js";

const { deleteCookie } = useCookie();

export const useStore = defineStore("store", {
  state: () => {
    return {
      user: null,
      admin: null,
      dostiz: null,
      placeholder: null,
      snils_admins: ["076-031-375-44", "180-978-180-97"],
      departments: [
        "Руководство Компании",
        "Блок бухгалтерии",
        "Блок Вице-президента-руководителя Аппарата ПАО «ЛУКОЙЛ»",
        "Блок корпоративной безопасности",
        "Блок нефтепереработки, нефтехимии, газопереработки",
        "Блок по внешним коммуникациям",
        "Блок по геологоразведке и разработке",
        "Блок по добыче нефти, газа и производственному сервису в России",
        "Блок по закупкам и управлению имуществом",
        "Блок по информационным технологиям",
        "Блок по персоналу и организационному развитию",
        "Блок по развитию бизнес-сегмента «Геологоразведка и добыча»",
        "Блок по управлению совместной деятельностью по региону Америка, Африка и Ближний Восток",
        "Блок по управлению совместной деятельностью по региону Центральная Азия и Каспийскому региону",
        "Блок поставок и продаж",
        "Блок правового обеспечения",
        "Блок реализации нефтепродуктов",
        "Блок экономики и планирования",
        "Департамент внутреннего контроля",
        "Департамент обеспечения добычи нефти и газа",
        "Департамент промышленной безопасности, экологии и научно-технических работ",
        "Дирекция по энергетике",
        "Налоговый блок",
        "Служба внутреннего аудита",
        "Финансовый блок",
        "Центр координации зарубежной деятельности",
      ],
      SpisokObshestv: [
        'ПАО "ЛУКОЙЛ"',
        'ООО "ЛУКОЙЛ-Западная Сибирь"',
        'ООО "ЛУКОЙЛ-Нижневолжскнефть"',
        'ООО "ЛУКОЙЛ-КМН"',
        'ООО "РИТЭК"',
        'ООО "ЛУКОЙЛ-ПЕРМЬ" вкл Коми',
        'ООО "ЛУКОЙЛ-Инжиниринг"',
        'ООО "ЭПУ Сервис"',
        'ООО "ЛУКОЙЛ-Волгограднефтепереработка"',
        'ООО "ЛУКОЙЛ-Нижегороднефтеоргсинтез"',
        'ООО "ЛУКОЙЛ-Пермнефтеоргсинтез"',
        'ООО "ЛУКОЙЛ-Ухтанефтепереработка"',
        'ООО "Саратоворгсинтез"',
        'ООО "Ставролен"',
        'ООО "ЛУКОЙЛ-Югнефтепродукт"',
        'ООО "ЛУКОЙЛ-Югнефтепродукт"(Курский регион)',
        'ООО "ЛУКОЙЛ-Уралнефтепродукт"',
        'ООО "ЛУКОЙЛ-Северо-Западнефтепродукт"',
        'ООО "ЛУКОЙЛ-Центрнефтепродукт"',
        'ООО "ЛИКАРД"',
        'ООО "ЛУКОЙЛ-ЭНЕРГОСЕТИ"',
        'ООО "ЛУКОЙЛ-Ростовэнерго"',
        'ООО "ЛУКОЙЛ-Кубаньэнерго"',
        'ООО "ЛУКОЙЛ-Астраханьэнерго"',
        'ООО "ЛУКОЙЛ-Волгоградэнерго"',
        'ООО "ЛУКОЙЛ-Энергоинжиниринг"',
        'ООО "ЛУКОЙЛ-Экоэнерго"',
        'ООО "ЛУКОЙЛ-Транс"',
        'АО "ЛУКОЙЛ-Черноморье"',
        'ООО "ЛУКОЙЛ-АЭРО"',
        'ООО "ЛЛК-Интернешнл"',
        'ООО "ЛУКОЙЛ-Технологии"',
        'ООО "ЛУКОЙЛ-МЦПБ"',
        'ООО "ЛИНК"',
        'ООО "ЛУН-Инвест"',
        'ООО "ЛУКОЙЛ-РНП-Трейдинг"',
        'ИОО "ЛУКОЙЛ Белоруссия"',
        'ООО "УралОйл"',
        'ООО "Агентство "ЛУКОМ-А"',
        'ПАО "ЭЛ5-Энерго"',
        'ООО "СПЕЦПРОМСЕРВИС"',
        "ЛАФЕ ДМСС",
        'ООО "Тебойл Рус"',
        'МОПО ПАО "ЛУКОЙЛ"',
        'ООО "ЛУКОЙЛ-ЦУР"',
        'ООО "ЛУКОЙЛ ПЕРСОНАЛ"',
        "ООО «К.Н. Холдинг»",
      ],
      educationDirections: [
        {
          id: 0,
          direction: "IT- направление",
          name: "Основы робототехники",
          minAge: 9,
          maxAge: 13,
        },
        {
          id: 1,
          direction: "IT- направление",
          name: "Создание чат-бота",
          minAge: 14,
          maxAge: 17,
        },
        {
          id: 2,
          direction: "Лидерство и управление",
          name: "Развитие эмоционального интелекта",
          minAge: 14,
          maxAge: 17,
        },
        {
          id: 3,
          direction: "Туристическое направление",
          name: "Туризм",
          minAge: 9,
          maxAge: 13,
        },
        {
          id: 4,
          direction: "IT- направление",
          name: "Мультипликация: создание персонажей, 2D-анимация персонажа",
          minAge: 9,
          maxAge: 13,
        },
        {
          id: 5,
          direction: "Естественно-научное",
          name: "Биологическое направление",
          minAge: 9,
          maxAge: 13,
        },
        {
          id: 6,
          direction: "Естественно-научное",
          name: "Биологическое направление",
          minAge: 14,
          maxAge: 17,
        },
        {
          id: 7,
          direction: "Дизайн",
          name: "Веб-дизайн. 3D-моделирование. 3D-принтер",
          minAge: 14,
          maxAge: 17,
        },
        {
          id: 8,
          direction: "IT- направление",
          name: "Геймификация. Разработка проектов виртуальной реальности для бизнеса",
          minAge: 14,
          maxAge: 17,
        },
        {
          id: 9,
          direction: "Дизайн",
          name: "ИЗО. Графика. Народное- прикладное творчество",
          minAge: 9,
          maxAge: 13,
        },
        {
          id: 10,
          direction: "Искусство",
          name: "Актерское мастерство",
          minAge: 9,
          maxAge: 13,
        },
      ],
      subjectAreas: [
        {
          id: 37,
          subject: "Сертификат 20 баллов",
          ball: [20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
          type: "Подарочные сертификаты",
        },
        {
          id: 38,
          subject: "Сертификат 10 баллов",
          ball: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10],
          type: "Подарочные сертификаты",
        },
        {
          id: 39,
          subject: "Сертификат 5 баллов",
          ball: [5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5],
          type: "Подарочные сертификаты",
        },
        {
          id: 40,
          subject: "Прочие достижения",
          ball: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
          type: "Прочие достижения",
        },
        {
          id: 41,
          subject: "Вокал и актерское мастерство",
          ball: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3],
          type: "Актерское мастерство",
        },

        {
          id: 0,
          subject: "Русский язык",
          ball: [1, 1, 3, 1, 1, 2, 2, 2, 2, 2, 3],
          type: "Естественные",
        },
        {
          id: 1,
          subject: "Литература",
          ball: [0, 1, 3, 1, 1, 1, 1, 2, 2, 2, 3],
          type: "Естественные",
        },
        {
          id: 2,
          subject: "Математика",
          ball: [3, 3, 1, 1, 1, 2, 2, 3, 3, 1, 1],
          type: "Управление",
        },
        {
          id: 3,
          subject: "Биология",
          ball: [0, 0, 0, 0, 0, 3, 3, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 4,
          subject: "География",
          ball: [0, 0, 1, 3, 0, 2, 2, 0, 0, 1, 0],
          type: "Естественные",
        },
        {
          id: 5,
          subject: "Природоведение",
          ball: [0, 0, 0, 3, 0, 2, 2, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 6,
          subject: "Астрономия и астрофизика",
          ball: [0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 7,
          subject: "Информатика",
          ball: [3, 3, 0, 0, 3, 0, 0, 3, 3, 0, 0],
          type: "Программирование",
        },
        {
          id: 8,
          subject: "Физика",
          ball: [3, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 9,
          subject: "Химия",
          ball: [0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 10,
          subject: "Иностранный язык",
          ball: [0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 1],
          type: "Управление",
        },
        {
          id: 11,
          subject: "Экология",
          ball: [0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 12,
          subject: "История",
          ball: [0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 2],
          type: "Управление",
        },
        {
          id: 13,
          subject: "Обществознание",
          ball: [0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
          type: "Управление",
        },
        {
          id: 14,
          subject: "Экономика и управление",
          ball: [0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
          type: "Управление",
        },
        {
          id: 15,
          subject: "Право",
          ball: [0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
          type: "Управление",
        },
        {
          id: 16,
          subject: "Изобразительное искусство",
          ball: [0, 0, 0, 0, 2, 0, 0, 0, 0, 3, 0],
          type: "Естественные",
        },
        {
          id: 17,
          subject: "Археология",
          ball: [0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 18,
          subject: "Программирование",
          ball: [3, 3, 0, 0, 2, 0, 0, 3, 3, 0, 0],
          type: "Программирование",
        },
        {
          id: 19,
          subject: "Электроника",
          ball: [2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
          type: "Программирование",
        },
        {
          id: 20,
          subject: "Дизайн",
          ball: [0, 0, 0, 0, 3, 0, 0, 3, 2, 3, 0],
          type: "Программирование",
        },
        {
          id: 21,
          subject: "Мультипликация и анимация",
          ball: [0, 0, 0, 0, 3, 0, 0, 1, 3, 0, 0],
          type: "Программирование",
        },
        {
          id: 22,
          subject: "Фотоискусство",
          ball: [0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0],
          type: "Программирование",
        },
        {
          id: 23,
          subject: "Компьютерная графика",
          ball: [0, 0, 0, 0, 0, 0, 0, 3, 2, 1, 0],
          type: "Программирование",
        },
        {
          id: 24,
          subject: "Скульптура",
          ball: [0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 25,
          subject: "Журналистика",
          ball: [0, 0, 2, 1, 0, 0, 0, 0, 0, 0, 1],
          type: "Управление",
        },
        {
          id: 26,
          subject: "Веб-дизайн",
          ball: [0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0],
          type: "Программирование",
        },
        {
          id: 27,
          subject: "Робототехника",
          ball: [3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
          type: "Программирование",
        },
        {
          id: 28,
          subject: "Зоология",
          ball: [0, 0, 0, 0, 0, 2, 2, 0, 0, 0, 0],
          type: "Естественные",
        },
        {
          id: 29,
          subject: "Декоративно-прикладное искусство",
          ball: [0, 0, 0, 0, 2, 0, 0, 0, 0, 3, 1],
          type: "Естественные",
        },
        {
          id: 30,
          subject: "Рисунок",
          ball: [0, 0, 0, 0, 2, 0, 0, 2, 0, 3, 0],
          type: "Естественные",
        },
        {
          id: 31,
          subject: "Социология",
          ball: [0, 0, 2, 2, 0, 0, 0, 0, 0, 0, 2],
          type: "Управление",
        },
        {
          id: 32,
          subject: "Медицина, анатомия",
          ball: [0, 0, 0, 0, 1, 2, 2, 0, 0, 0, 2],
          type: "Естественные",
        },
        {
          id: 33,
          subject: "Инженерные науки",
          ball: [3, 3, 0, 0, 0, 0, 0, 3, 2, 0, 0],
          type: "Программирование",
        },
        {
          id: 34,
          subject: "Культурология",
          ball: [0, 0, 3, 2, 0, 0, 0, 0, 0, 0, 2],
          type: "Управление",
        },
        {
          id: 35,
          subject: "Психология",
          ball: [0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 1],
          type: "Управление",
        },
        {
          id: 36,
          subject: "Философия",
          ball: [0, 0, 3, 1, 0, 0, 0, 0, 0, 0, 1],
          type: "Управление",
        },
      ],
      status: [
        {
          id: 0,
          name: "Победитель",
          status: 3,
        },
        {
          id: 1,
          name: "Призер",
          status: 2,
        },
        {
          id: 2,
          name: "Участник",
          status: 1,
        },
      ],
      competitionLevel: [
        {
          id: 0,
          name: "Высший уровень (всероссийские и международные мероприятия)",
          level: 3,
        },
        {
          id: 1,
          name: "1 уровень (региональные мероприятия)",
          level: 2,
        },
        {
          id: 2,
          name: "2 уровень (муниципальные/местные мероприятия)",
          level: 1,
        },
        {
          id: 3,
          name: "Мероприятия, проводимые посредством Интернет-технологий",
          level: 1,
        },
      ],
    };
  },

  actions: {
    setUser(user) {
      if (user) {
        this.user = user;
      }
    },
    setAdmin(admin) {
      if (admin || admin == null) {
        this.admin = admin;
        localStorage.setItem("admin", 1);
      }
    },
    setGlobalAdmin(admin) {
      if (admin || admin == null) {
        this.admin = admin;
        localStorage.setItem("admin", 2);
      }
      //  this.setUser(admin);
    },
    setDostiz(dostiz) {
      if (dostiz) {
        this.dostiz = dostiz;
        localStorage.setItem("dostiz", JSON.stringify(dostiz));
        console.log(this.dostiz);
      }
    },
    async getUser() {
      if (this.user && this.user.isRegistered) return true;

      try {
        const res = await http.get("/user/me");

        if (res.data) {
          this.setUser(res.data.user);
        }

        return true;
      } catch (error) {
        console.log(error);
        return false;
      }

      let user = JSON.parse(localStorage.getItem("user"));
      this.user = user;
      let dostiz = JSON.parse(localStorage.getItem("dostiz"));
      this.dostiz = dostiz;
    },
    deleteUser() {
      localStorage.removeItem("user");
      this.placeholder = this.user;
      this.user = null;
    },
    getPropertiesArray(arr, property) {
      return this[arr].map((el) => el[property]);
    },
    getPointsByType(type) {
      return this.subjectAreas
        .filter((subject) => subject.type == type)
        .reduce(
          (total_sum, el) =>
            total_sum + el.ball.reduce((sum, el) => sum + el, 0),
          0
        );
    },
  },
  getters: {
    getAge() {
      if (!this.user) return null;

      return Math.trunc(
        (Date.now() - new Date(this.user.date_rozd)) /
          (1000 * 60 * 60 * 24 * 365)
      );
    },
    getSuitableDirections() {
      const arr = [];

      this.educationDirections.forEach((direction) => {
        if (
          this.getAge >= direction.minAge &&
          this.getAge <= direction.maxAge
        ) {
          arr.push(direction);
        }
      });

      return arr;
    },
    isAdmin() {
      if (!this.user) return false;
      //  console.log(this.user);
      return this.isGlobalAdmin || this.isLocalAdmin;
    },
    isGlobalAdmin() {
      if (localStorage.getItem("admin") == 2) return true;
      return false;
    },
    isLocalAdmin() {
      if (localStorage.getItem("admin") == 1) return true;
      return false;
    },
  },
});
